---
kind: type
id: T:Autodesk.Revit.DB.FamilyThermalProperties
source: html/9d9b2125-8398-9b55-8219-cbda4456ab7b.htm
---
# Autodesk.Revit.DB.FamilyThermalProperties

A class that contains thermal properties for specific types of families
 (doors, windows, and curtain wall panels).

## Syntax (C#)
```csharp
public class FamilyThermalProperties : IDisposable
```